<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>

  <key>Identifier</key>
  <string>local.jamf.DigiExam</string>

  <!-- Chain from the new PKG recipe so this picks up the new download URL/app name -->
  <key>ParentRecipe</key>
  <string>org.dalton.cotis.pkg.Digiexam</string>

  <key>Input</key>
  <dict>
    <!-- Keep your Jamf-facing display name as DigiExam -->
    <key>NAME</key>
    <string>DigiExam</string>

    <!-- Force pkg name to match the new pkg recipe output (one-word app name) -->
    <key>PKG_NAME</key>
    <string>Digiexam-%version%.pkg</string>

    <!-- Your existing Jamf settings -->
    <key>CATEGORY</key>
    <string>Productivity</string>

    <key>POLICY_CATEGORY</key>
    <string>Patch Management - Updates</string>

    <key>GROUP_NAME</key>
    <string>%NAME%-update-smart</string>
    <key>GROUP_TEMPLATE</key>
    <string>JamfSmartGroupTemplate.xml</string>

    <key>POLICY_NAME</key>
    <string>Install Latest %NAME%</string>
    <key>POLICY_TEMPLATE</key>
    <string>JamfPolicyTemplateAllCompScope.xml</string>

    <key>SELF_SERVICE_DESCRIPTION</key>
    <string>Online testing platform</string>
    <key>SELF_SERVICE_DISPLAY_NAME</key>
    <string>Install Latest %NAME%</string>
    <key>SELF_SERVICE_ICON</key>
    <string>%NAME%.png</string>

    <key>TESTING_GROUP_NAME</key>
    <string>Testing</string>

    <!-- Only proceed with group/policy work if a new pkg was uploaded -->
    <key>UPDATE_PREDICATE</key>
    <string>pkg_uploaded == False</string>
  </dict>

  <key>MinimumVersion</key>
  <string>1.0.0</string>

  <key>Process</key>
  <array>

    <!-- 1) Upload (or replace) the package from the PKG parent -->
    <dict>
      <key>Processor</key>
      <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
      <key>Arguments</key>
      <dict>
        <!-- jss_url/api_username/api_password are expected via override/keychain/env -->
        <key>pkg_path</key>
        <string>%pkg_path%</string>
        <key>pkg_name</key>
        <string>%PKG_NAME%</string>
        <key>category</key>
        <string>%CATEGORY%</string>
        <!-- optional knobs you can add later:
             <key>replace</key><true/>
             <key>priority</key><string>10</string> -->
      </dict>
    </dict>

    <!-- 2) If no new upload happened, stop before group/policy work -->
    <dict>
      <key>Processor</key>
      <string>StopProcessingIf</string>
      <key>Arguments</key>
      <dict>
        <key>predicate</key>
        <string>%UPDATE_PREDICATE%</string>
      </dict>
    </dict>

    <!-- 3) Ensure/update Smart Group from your template -->
    <dict>
      <key>Processor</key>
      <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
      <key>Arguments</key>
      <dict>
        <key>group_name</key>
        <string>%GROUP_NAME%</string>
        <key>template_path</key>
        <string>%GROUP_TEMPLATE%</string>
        <!-- optional: <key>replace_group</key><true/> -->
      </dict>
    </dict>

    <!-- 4) Create/update Policy from your template and attach the pkg -->
    <dict>
      <key>Processor</key>
      <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
      <key>Arguments</key>
      <dict>
        <key>policy_name</key>
        <string>%POLICY_NAME%</string>
        <key>template_path</key>
        <string>%POLICY_TEMPLATE%</string>

        <!-- Attach the package we just uploaded -->
        <key>package</key>
        <string>%PKG_NAME%</string>

        <!-- Category and Self Service metadata -->
        <key>category</key>
        <string>%POLICY_CATEGORY%</string>
        <key>self_service</key>
        <true/>
        <key>self_service_display_name</key>
        <string>%SELF_SERVICE_DISPLAY_NAME%</string>
        <key>self_service_description</key>
        <string>%SELF_SERVICE_DESCRIPTION%</string>
        <key>icon</key>
        <string>%SELF_SERVICE_ICON%</string>

        <!-- If your template references a testing group -->
        <key>testing_group_name</key>
        <string>%TESTING_GROUP_NAME%</string>
      </dict>
    </dict>

  </array>
</dict>
</plist>
