<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Comment</key>
  <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
  <key>Description</key>
  <string>Downloads the latest version of Digiexam.</string>

  <key>Identifier</key>
  <string>org.dalton.cotis.download.Digiexam</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Digiexam</string>
  </dict>

  <key>MinimumVersion</key>
  <string>1.0.0</string>

  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>%NAME%.dmg</string>
        <key>url</key>
        <string>https://www.digiexam.com/hubfs/client/Digiexam_Mac_universal.dmg</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>

    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>

    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%pathname%/Digiexam.app</string>
        <key>requirement</key>
        <string>identifier "se.digiexam.DigiExam" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "73T9H7VE4P"</string>
      </dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
    </dict>

    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%pathname%/Digiexam.app/Contents/Info.plist</string>
        <key>plist_version_key</key>
        <string>CFBundleShortVersionString</string>
      </dict>
      <key>Processor</key>
      <string>Versioner</string>
    </dict>
  </array>
</dict>
</plist>
