<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Builds a pkg for Digiexam from the downloaded DMG.</string>

  <key>Identifier</key>
  <string>org.dalton.cotis.pkg.Digiexam</string>

  <key>ParentRecipe</key>
  <string>org.dalton.cotis.download.Digiexam</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Digiexam</string>
  </dict>

  <key>MinimumVersion</key>
  <string>1.0.0</string>

  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>AppPkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>app_path</key>
        <string>%pathname%/Digiexam.app</string>
        <key>version</key>
        <string>%version%</string>
        <!-- Optional: customize identifier if you want your own -->
        <!-- <key>pkg_identifier</key>
        <string>org.dalton.cotis.pkg.Digiexam</string> -->
        <key>pkg_name</key>
        <string>%NAME%-%version%.pkg</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
